<template>
  <aside>
    <ul>
      <li v-for="(item1,index1) of asideData" :key="index1">
        <i :class="item1.icon"></i>
        <span>{{item1.title}}</span>
        <div class="second-nav">
          <div class="tag-row">
            <el-tag effect="dark" type="info" v-for="(item2,index2) of item1.secondNavTag" :key="index2">{{item2}}></el-tag>
          </div>
          <el-row :gutter="20" v-for="(item3,index3) of item1.secondNavLinks" :key="index3">
            <el-col :span="2" class="title">
              <span>{{item3.titleLink}}></span>
            </el-col>
            <el-col :span="20" class="content-link">
              <span v-for="(item4,index4) of item3.contentLink" :key="index4">{{item4}}</span>
            </el-col>
          </el-row>
        </div>
      </li>
    </ul>
    <div class="fade-ad"></div>
  </aside>
</template>
<script>
export default {
  data() {
    return {
      asideData: [
        {
          icon:'el-icon-table-lamp',
          title: "家用电器",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-mobile-phone',
          title: "手机/运营商/数码",
          secondNavTag: ["玩3C","手机频道","网上营业厅","配件频道","智能数码","影像Club"],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-s-platform',
          title: "电脑/办公",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-football',
          title: "男装/女装/童装/内衣",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "美妆/个护/宠物",
          secondNavTag: ["清洁用品","美妆馆","个护馆","妆比社","京东国际美妆","宠物馆",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
            {
              titleLink:'宠物生活',
              contentLink:["狗粮","狗罐头","狗零食","猫粮","猫罐头","猫零食","猫砂","猫砂盆","猫狗窝","食具水具","医疗保健","宠物玩具","宠物鞋服","洗护美容","宠物牵引","小宠用品","水族世界","鱼缸/水族箱","鱼粮/饲料","宠物活体",
              ]
            }
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "男鞋/运动/户外",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "女鞋/箱包/钟表/珠宝",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "母婴/玩具/乐器",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "艺术/礼品/鲜花/农贸",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "艺术/礼品/鲜花/农贸",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "艺术/礼品/鲜花/农贸",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-table-lamp',
          title: "外设/影音/游戏手柄",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
        {
          icon:'el-icon-place',
          title: "外设/影音/游戏手柄",
          secondNavTag: ["家电馆","家电专卖店","家电服务","企业采购","商用电器","以旧换新",
          ],
          secondNavLinks: [
            {
              titleLink: "电视",
              contentLink: ["超薄电视","全面屏电","智能电视","教育电视","OLED","4K超清","智慧屏","55英寸","65英寸","电视配件",
              ],
            },
            {
              titleLink: "空调",
              contentLink: ["空调挂机","空调柜机","中央空调","变频空调","一级能效","移动空调","以旧换新",
              ],
            },
            {
              titleLink: "洗衣机",
              contentLink: [  "滚筒洗衣机",  "洗烘一体机",  "波轮洗衣机",  "迷你洗衣机",  "烘干机",  "洗衣机配件",],
            },
            {
              titleLink:'冰箱',
              contentLink:["多门","对开","三门","双门","冷柜","酒柜","冰箱",]
            },
            {
              titleLink:'厨卫大电',
              contentLink:["油烟机","燃气灶","烟灶套","集成灶","消毒柜","洗碗机","电热水","燃气热","空气能","太阳能","嵌入式","烟机灶",]
            },
            {
              titleLink:'厨房小电',
              contentLink:["破壁机","电烤箱","电饭煲","电压力","电炖锅","豆浆机","料理机","咖啡机","电饼铛","榨汁机机","电水壶瓶","微波炉","电热饭","电火锅","养生壶","电磁炉","面包机","空气炸","面条机","电陶炉","煮蛋器","电烧烤",
              ]
            },
            {
              titleLink:'生活电器',
              contentLink:["电风扇","冷风扇","空气净化器","吸尘器","除螨仪","扫地机器人","除湿机","干衣机","蒸汽拖把/拖地机","挂烫机/熨斗","电话机","饮水机","净水器","取暖器","加湿器","毛球修剪器","生活电器配件",
              ]
            },
            {
              titleLink:'个护健康',
              contentLink:["剃须刀","电动牙刷","电吹风","美容仪","洁面仪","按摩器","健康秤","卷/直发器","剃/脱毛器","理发器","足浴盆","足疗机","按摩椅",
              ]
            },
            {
              titleLink:'视听影音',
              contentLink:["家庭影院","KTV音响","迷你音响","DVD","功放","回音壁","麦克风",
              ]
            },
          ],
        },
      ],
    };
  },
};
</script>
<style lang='scss'>
aside {
  height: 400px;
  width: 100%;
  display: flex;
  justify-content: space-between;
  ul {
    list-style: none;
    padding: 0;
    margin: 0;
    width: 180px;
    position: relative;
    li {
      span {
        line-height: 30px;
        &:hover {
          cursor: pointer;
        }
      }
      display: block;
      &:hover {
        .second-nav {
          z-index: 9;
          opacity: 1;
          transition: 0.5s;
          left: 200px;
        }
      }
      .second-nav {
        transition: 0.5s;
        opacity: 0;
        position: absolute;
        width: 1000px;
        height: 400px;
        background: #fff;
        top: 0;
        left: 180px;
        z-index: -1;
        font-size: 12px;
        .el-tag {
          margin-right: 5px;
        }
        .title {
          text-align: end;
          font-weight: 700;
        }
        .content-link {
          span {
            margin-right: 10px;
            &:hover {
              color: crimson;
            }
          }
        }
      }
    }
  }
  .fade-ad{
    width:150px;
    height: 400px;
    animation: fadeAd 18s infinite;
    background-size: cover;
  }
}

@keyframes fadeAd {
  0%{
    background-image: url('../../../../../assets/yangSrc/images/aside1.png');
  };
  25%{
    background-image: url('../../../../../assets/yangSrc/images/aside1.png');
  };
  33%{
    background-image: url('../../../../../assets/yangSrc/images/aside2.png');
  };
  58%{
    background-image: url('../../../../../assets/yangSrc/images/aside2.png');
  };
  66%{
    background-image: url('../../../../../assets/yangSrc/images/aside3.png');
  };
  92%{
    background-image: url('../../../../../assets/yangSrc/images/aside3.png');
  };
  100%{
    background-image: url('../../../../../assets/yangSrc/images/aside1.png')
  }
}
</style>